'''. 1.Berserk должен получать от босса
урон, затем при ударе наносить ему свой
урон, плюс
часть накопленного урона полученного
от босса'''
'''2.Thor, удар по боссу имеет шанс
оглушить босса на 1 раунд, вследствие
чего босс пропускает 1 раунд и не
наносит урон героям'''
'''3.Golem, который имеет увеличенную
жизнь но слабый удар. Может принимать
на себя 1/5 часть урона исходящего от
босса по другим игрокам'''
'''4.Witcher, не наносит урон боссу, но
получает урон от босса. Имеет 1 шанс
оживить первого погибшего героя, отдав
ему свою жизнь, при этом погибает сам'''
'''5.Avrora, которая может входить в
режим невидимости на 2 раунда (т.е не
получает урон от босса), в тоже время
полученный урон в режиме невидимости
возвращает боссу в последующих
раундах. Она может исчезать только
один раз за игру'''
'''6.Druid, который имеет способность
рандомно призывать помощника ангела
героям или же ворона боссу на 1 раунд
за всю игру. "Ангел" увеличивает
способность медика лечить героев на n
кол-во. А ворон прибавляет агрессию
(увеличивается урон на 50%), боссу
если его жизнь менее 50%'''
'''7.AntMan, в каждом раунде он может
увеличиться или же уменьшится на Nный размер, также увеличиваются/
уменьшаются жизнь и урон, после
раунда он возвращается в исходный
размер'''



